0/U
/*----------------*- C++ -*----------------------------------*\
| =========                 |                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD   |
|  \\    /   O peration     | Version:  v2312 / Standard      |
|   \\  /    A nd           | Website:  www.openfoam.com      |
|    \\/     M anipulation  |                                 |
\*-----------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); // Stagnant water initially

boundaryField
{
    axis
    {
        type            empty;
    }
    wedgeFront
    {
        type            wedge;
    }

    wedgeBack
    {
        type            wedge;
    }
    // Outer cylinder wall
    wall
    {
        type            noSlip;
    }

    // Bottom floor (closed solid bottom)
    inlet
    {
        type            noSlip;
    }

    // Open top boundary
    outlet
    {
    type            pressureInletOutletVelocity;
    value           uniform (0 0 0);
    }
}

// ************************************************************************* //