0/p_rgh
/*----------------*- C++ -*----------------------------------*\
| =========                 |                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD   |
|  \\    /   O peration     | Version:  v2312 / Standard      |
|   \\  /    A nd           | Website:  www.openfoam.com      |
|    \\/     M anipulation  |                                 |
\*-----------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{   
    axis
    {
        type            empty;
    }
    wedgeFront
    {
        type            wedge;
    }

    wedgeBack
    {
        type            wedge;
    }

    // Outer wall: balances hydrostatic pressure head
    wall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    // Bottom floor: balances hydrostatic pressure head
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    // Top atmospheric boundary
    outlet
    {
    type            prghTotalPressure;
    p0              uniform 0;
    value           uniform 0;
    }
}

// ************************************************************************* //