system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration      |
    \\  /    A nd            |
     \\/     M anipulation   |
*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    bubbleRegionSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            // Select the 2D x-z region across the complete wedge thickness.
            box (0 -0.0001 0) (0.002 0.0001 0.09);
        }
    }
    {
        name    bubbleRegion;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set bubbleRegionSet;
        }
    }
);
